## :burrito: Burrito Report

1 layer(s) affected with d3afa3e66737028a46b1dc9c00111b3b4988e492 commit.



### Layer .

`Plan: 1 to create, 0 to update, 1 to delete`

<details>
<summary>Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # local_file.config must be replaced
-/+ resource "local_file" "config" {
      ~ content              = <<-EOT
            # Configuration File
            # Generated by Terraform for Burrito Tag Support Testing
            
            Project: burrito-test
            Environment: dev
            Generated: 2025-07-09T20:55:40Z
            
            # This file demonstrates Burrito's ability to clone repositories
            # using both branch and tag references for Terraform deployments.
            
            ---
            Infrastructure Details:
            - Provider: Local (for testing)
            - Managed by: Burrito Kubernetes Operator
            - Configuration Version: Using Git tags for versioning
        EOT -> (known after apply) # forces replacement
      ~ content_base64sha256 = "VnCtF1peYb0E2rbfUHM3o4Ty0iMjcYZhRlcbIQoKOA8=" -> (known after apply)
      ~ content_base64sha512 = "I9wtBjBUsXkWw2XgpylEp5Toka+yuJ0zu84rN4RY7OGMoJUEQHNN1SAlu6zkehkeJKdNWHKE8+g5hdlxd55NZg==" -> (known after apply)
      ~ content_md5          = "d0154ef6ba3155ced405ae6dbaa13825" -> (known after apply)
      ~ content_sha1         = "7adfc67a4656766aa63bdd369ef962d71aa17c78" -> (known after apply)
      ~ content_sha256       = "5670ad175a5e61bd04dab6df507337a384f2d2232371866146571b210a0a380f" -> (known after apply)
      ~ content_sha512       = "23dc2d063054b17916c365e0a72944a794e891afb2b89d33bbce2b378458ece18ca0950440734dd52025bbace47a191e24a74d587284f3e83985d971779e4d66" -> (known after apply)
      ~ id                   = "7adfc67a4656766aa63bdd369ef962d71aa17c78" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + test_allowprontags = "Testing allowPrOnTags feature with tag v2.0.0"

```
</details>


